[
  {
    "path": "posts/welcome/",
    "title": "Welcome to Ian McDonald",
    "description": "Ian McDonald posts and professional material.",
    "author": [
      {
        "name": "Ian McDonald",
        "url": "http://www.ianrmcdonald.com"
      }
    ],
    "date": "2021-03-29",
    "categories": [],
    "contents": "\n\n\n\n",
    "preview": {},
    "last_modified": "2021-03-29T20:25:11-07:00",
    "input_file": "welcome.utf8.md"
  },
  {
    "path": "posts/2021-03-29-new-york-and-house-apportionment-in-2020/",
    "title": "New York and House Apportionment in 2020",
    "description": "Does apportionment have a small state bias?",
    "author": [
      {
        "name": "Ian McDonald",
        "url": "http://www.ianrmcdonald.com"
      }
    ],
    "date": "2020-12-28",
    "categories": [],
    "contents": "\nAbstract: New York will certainly lose at least one seat coming out of the 2020 census, but it could lose two. Will the apportionment method rob New York of its 26th seat in 2020? Will Montana unfairly receive a second seat? Perhaps, thanks to the measurable bias for smaller states in the House apportionment method adopted in 1941.\nToday, reports appeared about delays in final 2020 Census apportionment for the US House, which also changes state distribution of electors for the Electoral College. New population estimates were published on December 22, and they project New York will lose two of its current 27 seats. In 2019, New York was projected to lose one seat, but not two.\nOnce the census determines the country’s population, apportionment should be simple. Proportionality is the only requirement, aside from a guarantee of one representative.\nBut rounding introduces controversy and complexity, and rounding forumulas can bias the result. The formula tries to round fairly but must also ensure that the precise number of seats is allocated, which is 435 for the U.S. House. The current process, known as the Huntington-Hill Method, was enacted in 1941, and appears to produce a bias for smaller states.1\nDoes the Huntington Hill formula favor small states over big ones? Consider each state’s share of the vote as\n\\[\nQuota_{state} = \\frac{State Population}{US Population} \\times 435\n\\]\nThis result is a state’s quota. Because the quota includes a fractional remainder, the apportionment scheme must somehow round the result to a whole number. Using the December 2020 population estimate, New York’s seat quota would be:\n\\[\n\\text{New York Quota} = \\frac{19,336,776}{328,771,307} \\times 435 \\approx 25.59\n\\] \\[\n\\text{Montana Quota} = \\frac{1,080,577}{328,771,307} \\times 435 \\approx 1.430\n\\] New York’s quota rounds to 26, but the Huntington Hill apportionment formula somehow assigns only 25 seats. Montana’s quota rounds to 1, but the Huntington Hill formula will give it two seats.\nWebster, Huntington-Hill, and the Method of Equal Proportions\nThe apportionment rounding problem is well documented, full of surprising wrinkles, and inherent in any proportional seat allocation method. The U.S. House dates back to the 1790’s, and the important solutions were associated with statesmen, including Hamilton, Jefferson, John Quincy Adams, and Daniel Webster. In the decades before the 1940’s, Congress used a formula designed by Webster based on earlier work by Hamilton.2\nThe Webster formula applies the intuition that the allocation should round up when the remainder is greater than .5, and round down if the remainder is less.\nThe example below supposes that 435 seats will be apportioned between three lucky states: California, Oregon, and Washington. Start with the new 2020 estimates:\n\nState\nPopulation\nPop Pct\nQuota\nSeats\nCalifornia\n39368078\n76.7%\n333.802\n334\nOregon\n4241507\n8.3%\n35.964\n36\nWashington\n7693612\n15.0%\n65.234\n65\nTotal\n51303197\n100.0%\n435.000\n435\n\nIn this example, the rounded whole numbers add to 435, and we are finished.\nSuppose the population are slightly different, If the remainders are distributed differently, the number of seats may add to a number greater or less than 435. If so, we adjust the denominator so that some assignments are added or subtracted until the sum hits 435.\nIn the example below, the initial quotas generate seat totals of 436. By increasing the denominator (adding to the total population), California’s quota falls below 334.5, and eventually the rounded allocation drops from 335 seats to 334.\n\nState\nPopulation\nPop Pct\nInitial Quota\nInitial Seats\nAdjustment\nAdjusted Quota\nAdjusted Seats\nCalifornia\n40479078\n76.9%\n334.670\n335\n26780\n334.4999\n334\nOregon\n4441507\n8.4%\n36.721\n37\n26780\n36.7025\n37\nWashington\n7693612\n14.6%\n63.609\n64\n26780\n63.5764\n64\nTotal\n52614197\n100.0%\n435.000\n436\nNA\nNA\n435\n\nThe Webster method, and the Hamilton method that preceded it, generated paradoxes that were more apparent when the number of seats changed from census to census. In 1941 the Webster method was replaced by a design by statistician Joseph Hill and adapated by Harvard mathematician Edward Huntington.\nHuntington and Hill’s ignores the .5 rounding threshold and replaces it with the geometric mean of the two whole numbers closest state’s quota. The geometric mean of two consecutive integers is the square root of their product, and the remainder ranges beween .414 and .5.\n\\[\n\\text{For two consecutive whole numbers, the geometric mean =} \n\\sqrt{n\\times(n+1))}\n\\]\nIf the quota exceeds the geometric mean, we round up, and if not, we round down.\nSmall states produce a much smaller residual for their geometric means, compared to large states.\nEvery method has to allow for the possibility that the number of representatives produces sum that differs from the total number of seats allocated. For example, in the case of 2020, the Huntington and Hill formula described below generates a sum of 437 representatives on the first try.\nThe Huntington-Hill method seldom generates a different result from the Webster method, but usually has changed one or two results for each census since 1940. Huntington-Hill has a couple of useful but obscure mathematical properties, but it does not eliminate the possibility that too few or too many seats will be allocated on the first pass.\nFor the December 2020 estimate, the formula initially assigns 437 seats and must then adjust the denominator until the sum equals 435.\nConsider the problem of Montana and New York in 2020. The initial quotas are shown above. We would ordinarily expect Montana to round down from 1.430 to 1 seat, and New York rounds up from 25.584 to 26 seats.\nBut using the Huntington-Hill method, the total number of assigned seats is 437 on the first pass. We eliminate assignments by gradually increasing the denominator, which reduces every state’s quota. When this happens, two states eventually lose a representatives, which gets us to 435. The two states losing seats after this adjustment are Minnesota and New York.\nBy contrast, the Webster method gets it right on the first try with 435. That method assigns MT 1 seat, while NY gets 26.\n##How many states have been screwed as badly as NY might be 2020?\nSince the Huntington-Hill method came into effect for the 1940 census, nine censuses have produced 446 individual state apportionments. The method rounded down the seat allocation from quotas in 215 of the 446. Only 16 had residuals greater of than .5. The largest residual (i.e., the state losing a seat with the biggest rounding error) was California in the 1950 census.\nIf the current estimate holds, New York will produce second greatest loss since 1940.\nTwelve of these 16 unlucky states had seat counts of 10 or more.\n\nState\nPop\nYear\nSeats\nQuota\nResidual\nCA\n10586223\n1950\n30\n30.721514\n-0.7215143\nNY\n19336776\n2020\n25\n25.584646\n-0.5846462\nCA\n23668562\n1980\n45\n45.583556\n-0.5835562\nPA\n11319366\n1960\n27\n27.575861\n-0.5758610\nIN\n5490179\n1980\n10\n10.573599\n-0.5735990\nIL\n10081158\n1960\n24\n24.559380\n-0.5593801\nTN\n3291718\n1950\n9\n9.552657\n-0.5526574\nKY\n2944806\n1950\n8\n8.545909\n-0.5459091\nMA\n5148578\n1960\n12\n12.542794\n-0.5427936\nNJ\n7748634\n1990\n13\n13.535532\n-0.5355318\nMA\n6029051\n1990\n10\n10.531716\n-0.5317158\nMO\n4319813\n1960\n10\n10.523784\n-0.5237840\nGA\n5464265\n1980\n10\n10.523691\n-0.5236909\nNY\n18044505\n1990\n31\n31.520649\n-0.5206488\nCT\n3050693\n1970\n6\n6.505065\n-0.5050649\nOR\n2110810\n1970\n4\n4.500930\n-0.5009302\n\nTo compare with luckier states receiving an additional seat with a residual less than .5:\n\nState\nPop\nYear\nSeats\nQuota\nResidual\nNV\n110247\n1940\n1\n0.3660701\n0.3660701\nMT\n1080577\n2020\n2\n1.4297202\n0.4297202\nSD\n673247\n1970\n2\n1.4355805\n0.4355805\nCA\n33930798\n2000\n53\n52.4471539\n0.4471539\nNV\n160083\n1950\n1\n0.4645653\n0.4645653\nNC\n8067673\n2000\n13\n12.4702781\n0.4702781\nAR\n1949387\n1940\n7\n6.4728497\n0.4728497\nMN\n5314879\n2010\n8\n7.4776715\n0.4776715\nNH\n606921\n1960\n2\n1.4785607\n0.4785607\nRI\n1055247\n2010\n2\n1.4846604\n0.4846604\nMT\n701573\n1970\n2\n1.4959807\n0.4959807\n\nTheoretically, the quota would round down to zero for a very small state, but we have only seen this occur twice since 1940 (Nevada in 1940 and 1950). The Huntington-Hill method guarantees at least one seat for every state, without any adjustment, regardless of its population.\nThe second most generous seat allocation will be 2020 if the population figures hold: Montana, winning a second seat despite a small residual of .43. Both New York’s smaller apportionment and Montana’s larger one are historic.\nHow many states have been rewarded with a bonus as big as Montana’s?\nMontana will make history for the lowest quota that yields an extra seat from Huntington Hill. Montana is always kind of on the bubble and its Supreme Court challenge after the 1990 apportionment reflects that. But a quota below 1.5 that yields two seats just doesn’t happen very often.\nonly states with quotas below 1.5?\nHow many times has HH differred from Webster?\nEvery time, except once, the seat moves from a bigger state to a much smaller one.\n\nst_name\nyear\nquota\nhunhill\nwebster\nweb_v_hun\nmiss\nCalifornia\n1950\n30.721514\n30\n31\n1\n0.7215143\nNew York\n2020\n25.584646\n25\n26\n1\n0.5846462\nIndiana\n1980\n10.573599\n10\n11\n1\n0.5735990\nMassachusetts\n1960\n12.542794\n12\n13\n1\n0.5427936\nMassachusetts\n1990\n10.531716\n10\n11\n1\n0.5317158\nConnecticut\n1970\n6.505065\n6\n7\n1\n0.5050649\nOregon\n1970\n4.500930\n4\n5\n1\n0.5009302\nNorth Carolina\n2010\n13.458400\n13\n14\n1\n0.4584001\nMichigan\n1940\n17.452658\n17\n18\n1\n0.4526579\n\n\nst_name\nyear\nquota\nhunhill\nwebster\nweb_v_hun\nmiss\nMontana\n2020\n1.429720\n2\n1\n-1\n-0.5702798\nSouth Dakota\n1970\n1.435580\n2\n1\n-1\n-0.5644195\nArkansas\n1940\n6.472850\n7\n6\n-1\n-0.5271503\nNew Hampshire\n1960\n1.478561\n2\n1\n-1\n-0.5214393\nRhode Island\n2010\n1.484660\n2\n1\n-1\n-0.5153396\nMontana\n1970\n1.495981\n2\n1\n-1\n-0.5040193\nNew Mexico\n1980\n2.503623\n3\n2\n-1\n-0.4963767\nOklahoma\n1990\n5.515791\n6\n5\n-1\n-0.4842085\nKansas\n1950\n5.529231\n6\n5\n-1\n-0.4707692\n\nGiven these historic numbers, Montana does not deserve a second seat, and New York deserves a 26th. Perhaps the final apportion won’t reflect this kind of bias. But the US created an entire chamber dedicating to protecting the unfair numerical advantage of small states. The Senate bias is bad, and House shouldn’t make matters worse.\nhttps://www.census.gov/prod/cen2010/briefs/c2010br-08.pdf\nhttps://www.brookings.edu/research/dividing-the-house-why-congress-should-reinstate-an-old-reapportionment-formula/\nthe js calculator is here: https://isr.umich.edu/apportionment-calculator-for-us-census/\nhttps://www.census.gov/programs-surveys/popest/data/tables.html\nhttps://www.census.gov/history/pdf/Fairness_in_Apportionment_Young.pdf\nEconomist H. Peyton Young explaind the reasoning for this alternative and has argued that this method generates a bias for small states, despite claims from early in the 20c that the method is unbiased.\nBut I thought we assigned seats in ascending order?\nA clever way to regenerate the Huntington Hill method is described on the census web page at:\nThis approach produces the same results but eliminates any overallocation on the first pass and doesn’t convey the possibility that a seat is somehow being taken or given after the fact:\nAssign one seat to every one of the states.\nAssign the remaining 385 seats as follows:\nCompute a “priority score” that takes the population divided by the geometric mean of 1 and 2, or the seat the state already has times the number it would have with an additional seat.\nEvery state’s initial priority score is its population / sqrt (1*2), or its population / ~ 1.41.\nIdentify the state with the highest priority score and assign the 51st seat to that state. The 51st seat goes to the state with the greatest population.\nThat state now has two seats. Recompute that state’s priority score as its population divided by the geometric mean of n and n+1, where n is the new, higher number of the state’s seats.\nFor the state with the 51st seat, we now apply the geometric mean 2 and 3, which is sqrt(2*3) or sqrt(6), 2.449. Its priority score goes down accordingly.\nReorder the priority scores. The 52nd seat goes to the state with the newly determined high priority score. In all likelihood, the 52nd seat goes to a different state that now has 2 seats. Its priority score is also recomputed to a lower value.\nRepeat steps e and f until all 435 seats have been allocated. In each iteration, the priority score is recalculated and reduced, and the state awarded a given seats (probably) moves somewhere further back in the line.\n\nAnd mirable dictu, you end up with the same result as the Huntington Hill method described above, but without the inelegance of changing the denominator after the initial assignment. In this way, the seat assignment are fun and nothing looks like a process that gives a seat and then takes it away. Some states will nearly miss the coveted “435th” seat assignment but the mechanism is prettier.\nLook at assignment if the continued; we get NY at 436 and MN at 437.\nSo why is MT (and not AL) the relevant comparison in my analysis? Because MT gets the biggest break in the adjustment to a geometric mean threshold. Rounding gets it nowhere near a second seat.\n\nstcd\nseat_counter\npriority\npopulation_margin\nMT\n2\n764083.3\n7965.656\nIL\n17\n763231.1\n78839.701\nFL\n29\n762689.7\n120792.276\nTX\n39\n762681.4\n162867.538\nAL\n7\n759408.9\n6209.324\nstcd\nseat_counter\npriority\npopulation_margin\nNY\n25\n758450.8\n24427.35\nMN\n7\n755994.1\n25553.65\nOH\n15\n754793.9\n71494.70\nCA\n52\n749902.2\n499079.76\nVA\n11\n747712.5\n134380.71\n\n\nIn a 2001 Brookings Institute report, economist H. Peyton Young writes, “Not only is it unnecessarily complex—involving square root formulas—it demonstrably favors small states at the expense of large states.”↩︎\nAmong many excellent summaries of the history (Young 2001) a Supreme Court ruling in 1992 lays out the formula variations over time. The Court overturned a lower court ruling that reinstated a second Montana seat from the 1990 census and supported the Huntington Hill formula in use since 1941.↩︎\n",
    "preview": {},
    "last_modified": "2021-03-29T19:43:36-07:00",
    "input_file": {}
  }
]
